// Створіть дві змінні для зберігання значень двох текстових полів. Перевірте, чи обидві змінні не є порожніми. Якщо обидва поля заповнені, вивести повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".
const text1 = prompt("ведить текст 1");
const text2 = prompt("ведить текст 2");
if (!text1 || !text2) {
  alert("Не всі поля заповнені");
} else {
  alert("Обидва поля заповнені");
}



//Створіть дві змінні для зберігання числових значень. Обчисліть їх суму. Якщо сума більше 10 — виведіть "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".
const num1 = Number(prompt("введіть число 1"));
const num2 = Number(prompt("введіть число 2"));
const num = num1 + num2
if (num > 10) {
    alert("Сума більша за 10");
} else {
    alert("Сума менша або дорівнює 10");
}



// Створіть змінну для зберігання тексту. Перевірте, чи містить цей текст слово "JavaScript". Якщо містить, виведіть "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".
const text = prompt("введіть текст")
if (text.includes("JavaScript")) {
    alert("Текст містить слово JavaScript");
} else {
    alert("Текст не містить слово JavaScript");
}



// Створіть змінну для зберігання числа. Перевірте, чи це число більше 10 і менше 20. Якщо так — виведіть "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".
const num3 = Number(prompt("введіть число"));
if (num3 > 10 && num3 < 20) {
    alert("Число входить в діапазон від 10 до 20");
} else {
    alert("Число не входить в діапазон від 10 до 20");
}



// Створіть змінні для зберігання значень полів (ім'я, email, пароль). Перевірте, чи ім'я містить не менше 3 символів, чи email містить символ @ та крапку після нього, а пароль не менше 6 символів. Якщо всі умови виконані — виведіть "Перенаправлення на іншу сторінку", якщо ні — "Помилка: неправильне заповнення".
const name = prompt("введіть ім'я");
const email = prompt("введіть email");
const password = prompt("введіть пароль");
if (name.length >= 3 && email.includes("@") && email.indexOf(".") > email.indexOf("@") && password.length >= 6) {
 alert("Перенаправлення на іншу сторінку")   
} else {
    alert("Помилка: неправильне заповнення");
}